In [9]:
#Pandas (stands for Python Data Analysis) is an open-source software library designed for data manipulation and analysis.

import pandas as pd
import numpy as np

lets load up the hotel booking dataset

In [12]:
df = pd.read_csv('hotel-booking-data.txt', delimiter='\t')
df.head()

         Date Company        Person Name  Room number
0  1-Jan-2022  Avamba  Anatole Ridehalgh       4008.0
1  1-Jan-2022    Fatz    Aldrich McKevin       2002.0
2  1-Jan-2022   Leexo    Stanley Hadrill       4012.0
3      Hotels     NaN                NaN          NaN
4  1-Jan-2022  Rhyzio       Lyndell Tice       1006.0

In [13]:
df.describe()

       Room number
count   153.000000
mean   3079.326797
std    1718.791186
min    1001.000000
25%    2001.000000
50%    3008.000000
75%    4010.000000
max    7002.000000

In [14]:
df['Company'].value_counts()

Company
Leexo           3
Quinu           3
Fivechat        3
Twitterlist     2
Jayo            2
               ..
Twitterwire     1
Skiba           1
Tagpad          1
Innojam         1
Twitterworks    1
Name: count, Length: 114, dtype: int64

In [15]:
df.dropna()

           Date       Company          Person Name  Room number
0    1-Jan-2022        Avamba    Anatole Ridehalgh       4008.0
1    1-Jan-2022          Fatz      Aldrich McKevin       2002.0
2    1-Jan-2022         Leexo      Stanley Hadrill       4012.0
4    1-Jan-2022        Rhyzio         Lyndell Tice       1006.0
5    1-Jan-2022         Eadel  Broderic Handscombe       3015.0
..          ...           ...                  ...          ...
186  1-Jan-2022        Tagpad       Stephani Lafee       1015.0
187  1-Jan-2022        Meevee      Victoria Lavery       7002.0
191  1-Jan-2022      Fivechat       Corabella Saye       4008.0
192  1-Jan-2022       Innojam    Leandra Potapczuk       5002.0
193  1-Jan-2022  Twitterworks      Valentia Ledson       1010.0

[134 rows x 4 columns]

In [20]:
df['2xRoom'] = df['Room number'] * 2
df

           Date       Company        Person Name  Room number   2xRoom
0    1-Jan-2022        Avamba  Anatole Ridehalgh       4008.0   8016.0
1    1-Jan-2022          Fatz    Aldrich McKevin       2002.0   4004.0
2    1-Jan-2022         Leexo    Stanley Hadrill       4012.0   8024.0
3        Hotels           NaN                NaN          NaN      NaN
4    1-Jan-2022        Rhyzio       Lyndell Tice       1006.0   2012.0
..          ...           ...                ...          ...      ...
190   Cleartrip           NaN                NaN          NaN      NaN
191  1-Jan-2022      Fivechat     Corabella Saye       4008.0   8016.0
192  1-Jan-2022       Innojam  Leandra Potapczuk       5002.0  10004.0
193  1-Jan-2022  Twitterworks    Valentia Ledson       1010.0   2020.0
194      Hotels           NaN                NaN          NaN      NaN

[195 rows x 5 columns]

In [23]:
df2 = df.dropna()

In [24]:
df2.head()

         Date Company          Person Name  Room number  2xRoom
0  1-Jan-2022  Avamba    Anatole Ridehalgh       4008.0  8016.0
1  1-Jan-2022    Fatz      Aldrich McKevin       2002.0  4004.0
2  1-Jan-2022   Leexo      Stanley Hadrill       4012.0  8024.0
4  1-Jan-2022  Rhyzio         Lyndell Tice       1006.0  2012.0
5  1-Jan-2022   Eadel  Broderic Handscombe       3015.0  6030.0

In [30]:
mask = df['Room number'].isna()

df['Text Value'] = np.where(mask, df['Date'], np.nan)
df

C:\Users\priya\AppData\Local\Temp\ipykernel_21744\365760437.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Text Value'] = np.where(mask, df['Date'], np.nan)

,Date,Company,Person Name,Room number,2xRoom,Text Value
0,1-Jan-2022,Avamba,Anatole Ridehalgh,4008.0,8016.0,NaN
1,1-Jan-2022,Fatz,Aldrich McKevin,2002.0,4004.0,NaN
2,1-Jan-2022,Leexo,Stanley Hadrill,4012.0,8024.0,NaN
4,1-Jan-2022,Rhyzio,Lyndell Tice,1006.0,2012.0,NaN
5,1-Jan-2022,Eadel,Broderic Handscombe,3015.0,6030.0,NaN
...,...,...,...,...,...,...
186,1-Jan-2022,Tagpad,Stephani Lafee,1015.0,2030.0,NaN
187,1-Jan-2022,Meevee,Victoria Lavery,7002.0,14004.0,NaN
191,1-Jan-2022,Fivechat,Corabella Saye,4008.0,8016.0,NaN
192,1-Jan-2022,Innojam,Leandra Potapczuk,5002.0,10004.0,NaN
193,1-Jan-2022,Twitterworks,Valentia Ledson,1010.0,2020.0,NaN

In [31]:
df['Text Value'].fillna(method='bfill')

C:\Users\priya\AppData\Local\Temp\ipykernel_21744\3215134943.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df['Text Value'].fillna(method='bfill')
C:\Users\priya\AppData\Local\Temp\ipykernel_21744\3215134943.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['Text Value'].fillna(method='bfill')

0     NaN
1     NaN
2     NaN
4     NaN
5     NaN
       ..
186   NaN
187   NaN
191   NaN
192   NaN
193   NaN
Name: Text Value, Length: 134, dtype: float64